[
  {
    "id": "insight-1",
    "tipo": "performance",
    "severidade": "alta",
    "titulo": "Alta latência na API de Pagamentos",
    "descricao": "A API de Pagamentos está apresentando tempos de resposta 45% acima do normal nas últimas 3 horas.",
    "impacto": "Isso está causando lentidão no processamento de transações e possivelmente afetando a experiência do usuário.",
    "causa_provavel": "Aumento no volume de requisições sem escalabilidade adequada.",
    "recomendacao": "Verificar a escalabilidade dos servidores e considerar aumentar recursos temporariamente.",
    "entidades_afetadas": [
      "API-Pagamentos"
    ],
    "tendencia": "crescente",
    "data_identificacao": "2025-06-29T18:30:00Z"
  },
  {
    "id": "insight-2",
    "tipo": "erro",
    "severidade": "média",
    "titulo": "Aumento na taxa de erro no serviço de Autenticação",
    "descricao": "O serviço de Autenticação está apresentando um aumento de 2.1% na taxa de erro nas últimas 30 minutos.",
    "impacto": "Alguns usuários podem estar enfrentando dificuldades para fazer login na plataforma.",
    "causa_provavel": "Recente implantação de nova funcionalidade pode estar causando falhas.",
    "recomendacao": "Revisar os logs de erro para identificar o padrão específico e considerar rollback se necessário.",
    "entidades_afetadas": [
      "API-Autenticacao"
    ],
    "tendencia": "estável",
    "data_identificacao": "2025-06-30T10:15:00Z"
  },
  {
    "id": "insight-3",
    "tipo": "recurso",
    "severidade": "baixa",
    "titulo": "Uso elevado de CPU no banco de dados",
    "descricao": "O banco de dados principal está operando com uso de CPU acima de 70% nas últimas 24 horas.",
    "impacto": "Baixo impacto no momento, mas pode causar degradação de performance se aumentar.",
    "causa_provavel": "Queries não otimizadas ou aumento no volume de dados.",
    "recomendacao": "Revisar as queries mais pesadas e considerar otimização.",
    "entidades_afetadas": [
      "Database-Principal"
    ],
    "tendencia": "decrescente",
    "data_identificacao": "2025-06-28T22:45:00Z"
  }
]